---
kind: property
id: P:Autodesk.Revit.DB.Events.FileImportingEventArgs.Format
source: html/e19e5ead-9a72-ebf9-74e4-3cb63f05f235.htm
---
# Autodesk.Revit.DB.Events.FileImportingEventArgs.Format Property

Identifies the import format, e.g. DWG or image.

## Syntax (C#)
```csharp
public ImportExportFileFormat Format { get; }
```